notes/fraction.org
:PROPERTIES:
:ID:       D3022798-A750-4B07-96CC-7ECE0CEDAE88
:END:
#+TITLE: Fraction

#+begin_src python
  from math import gcd

  class Fraction:
      def __init__(self, a, b):
          if b == 0:
              self.a = None
              self.b = None
          else:
              d = gcd(a, b)
              self.a = a // d
              self.b = b // d

      def __str__(self):
          return f"{self.a}/{self.b}"

      def __eq__(self, other):
          return self.a == other.a and self.b == other.b

      def __add__(self, other):
          if self.a is None or other.a is None:
              return self
          return Fraction(self.a * other.b + other.a * self.b, self.b * other.b)

      def __sub__(self, other):
          if self.a is None or other.a is None:
              return self
          return Fraction(self.a * other.b - other.a * self.b, self.b * other.b)

      def __mul__(self, other):
          if self.a is None or other.a is None:
              return self
          return Fraction(self.a * other.a, self.b * other.b)

      def __truediv__(self, other):
          if self.a is None or other.a is None:
              return self
          return self * Fraction(other.b, other.a)

  assert Fraction(45, 10) == Fraction(9, 2)
  assert Fraction(6, 6) == Fraction(1, 1)
  assert Fraction(1, 1) + Fraction(2, 2) == Fraction(4, 2) == Fraction(2, 1)
  assert Fraction(1, 1) - Fraction(2, 3) == Fraction(1, 3)
  assert Fraction(2, 3) * Fraction(4, 5) == Fraction(8, 15)
  assert Fraction(4, 1) / Fraction(1, 3) == Fraction(12, 1)
#+end_src
