fraction.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Fraction</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">
</head>
<body>
<!--  --><nav><a href="index.html">Problem Solving</a></nav><div id="content" class="content">
<h1 class="title">Fraction</h1>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> math <span style="font-weight: bold;">import</span> gcd

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Fraction</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>, a, b):
        <span style="font-weight: bold;">if</span> b == 0:
            <span style="font-weight: bold;">self</span>.a = <span style="font-weight: bold; text-decoration: underline;">None</span>
            <span style="font-weight: bold;">self</span>.b = <span style="font-weight: bold; text-decoration: underline;">None</span>
        <span style="font-weight: bold;">else</span>:
            d = gcd(a, b)
            <span style="font-weight: bold;">self</span>.a = a // d
            <span style="font-weight: bold;">self</span>.b = b // d

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__str__</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">return</span> f<span style="font-style: italic;">"</span>{<span style="font-weight: bold;">self</span>.a}<span style="font-style: italic;">/</span>{<span style="font-weight: bold;">self</span>.b}<span style="font-style: italic;">"</span>

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__eq__</span>(<span style="font-weight: bold;">self</span>, other):
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span>.a == other.a <span style="font-weight: bold;">and</span> <span style="font-weight: bold;">self</span>.b == other.b

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__add__</span>(<span style="font-weight: bold;">self</span>, other):
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">self</span>.a <span style="font-weight: bold;">is</span> <span style="font-weight: bold; text-decoration: underline;">None</span> <span style="font-weight: bold;">or</span> other.a <span style="font-weight: bold;">is</span> <span style="font-weight: bold; text-decoration: underline;">None</span>:
            <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span>
        <span style="font-weight: bold;">return</span> Fraction(<span style="font-weight: bold;">self</span>.a * other.b + other.a * <span style="font-weight: bold;">self</span>.b, <span style="font-weight: bold;">self</span>.b * other.b)

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__sub__</span>(<span style="font-weight: bold;">self</span>, other):
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">self</span>.a <span style="font-weight: bold;">is</span> <span style="font-weight: bold; text-decoration: underline;">None</span> <span style="font-weight: bold;">or</span> other.a <span style="font-weight: bold;">is</span> <span style="font-weight: bold; text-decoration: underline;">None</span>:
            <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span>
        <span style="font-weight: bold;">return</span> Fraction(<span style="font-weight: bold;">self</span>.a * other.b - other.a * <span style="font-weight: bold;">self</span>.b, <span style="font-weight: bold;">self</span>.b * other.b)

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__mul__</span>(<span style="font-weight: bold;">self</span>, other):
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">self</span>.a <span style="font-weight: bold;">is</span> <span style="font-weight: bold; text-decoration: underline;">None</span> <span style="font-weight: bold;">or</span> other.a <span style="font-weight: bold;">is</span> <span style="font-weight: bold; text-decoration: underline;">None</span>:
            <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span>
        <span style="font-weight: bold;">return</span> Fraction(<span style="font-weight: bold;">self</span>.a * other.a, <span style="font-weight: bold;">self</span>.b * other.b)

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__truediv__</span>(<span style="font-weight: bold;">self</span>, other):
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">self</span>.a <span style="font-weight: bold;">is</span> <span style="font-weight: bold; text-decoration: underline;">None</span> <span style="font-weight: bold;">or</span> other.a <span style="font-weight: bold;">is</span> <span style="font-weight: bold; text-decoration: underline;">None</span>:
            <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span>
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span> * Fraction(other.b, other.a)

<span style="font-weight: bold;">assert</span> Fraction(45, 10) == Fraction(9, 2)
<span style="font-weight: bold;">assert</span> Fraction(6, 6) == Fraction(1, 1)
<span style="font-weight: bold;">assert</span> Fraction(1, 1) + Fraction(2, 2) == Fraction(4, 2) == Fraction(2, 1)
<span style="font-weight: bold;">assert</span> Fraction(1, 1) - Fraction(2, 3) == Fraction(1, 3)
<span style="font-weight: bold;">assert</span> Fraction(2, 3) * Fraction(4, 5) == Fraction(8, 15)
<span style="font-weight: bold;">assert</span> Fraction(4, 1) / Fraction(1, 3) == Fraction(12, 1)
</pre>
</div>
</div>
</body>
</html>